tutorials/coriolisABLFoam/modifiedKepsilon/windVeering_FengAndGu2020_cyclicBCs_of1806+/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      RASProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType RAS;

RAS
{
    // Tested with kEpsilon, realizableKE, kOmega, kOmegaSST, v2f,
    // ShihQuadraticKE, LienCubicKE.
    RASModel        windVeeringABLkEpsilon;

    windVeeringABLkEpsilonCoeffs
    {
        Cmu              0.03;
        C1               1.52;
        C2               1.833;
        sigmaEps         3.254;
        sigmaK           2.169;
        lmax	     0.03123; // Feng and Gu (2020)
    }

    turbulence      on;

    printCoeffs     on;
}


// ************************************************************************* //
